SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/MGM27/Include/mgm27_prs.h
  __IOM uint32_t       CONSUMER_IADC0_SCANTRIGGER_CLR;   /**< SCAN consumer register                             */
  __IOM uint32_t       CONSUMER_IADC0_SINGLETRIGGER_CLR; /**< SINGLE Consumer register                           */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ0_CLR;    /**< DMAREQ0 consumer register                          */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ1_CLR;    /**< DMAREQ1 Consumer register                          */
  __IOM uint32_t       CONSUMER_LETIMER0_CLEAR_CLR;      /**< CLEAR consumer register                            */
  __IOM uint32_t       CONSUMER_LETIMER0_START_CLR;      /**< START Consumer register                            */
  __IOM uint32_t       CONSUMER_LETIMER0_STOP_CLR;       /**< STOP Consumer register                             */
  __IOM uint32_t       CONSUMER_MODEM_DIN_CLR;           /**< DIN consumer register                              */
  __IOM uint32_t       CONSUMER_PRORTC_CC0_CLR;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_PRORTC_CC1_CLR;          /**< CC1 Consumer register                              */
  uint32_t             RESERVED11[11U];                  /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_RAC_CLR_CLR;             /**< CLR consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN0_CLR;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN1_CLR;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN2_CLR;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN3_CLR;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_FORCETX_CLR;         /**< FORCETX Consumer register                          */
  __IOM uint32_t       CONSUMER_RAC_RXDIS_CLR;           /**< RXDIS Consumer register                            */
  __IOM uint32_t       CONSUMER_RAC_RXEN_CLR;            /**< RXEN Consumer register                             */
  __IOM uint32_t       CONSUMER_RAC_SEQ_CLR;             /**< SEQ Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_TXEN_CLR;            /**< TXEN Consumer register                             */
  __IOM uint32_t       CONSUMER_RTCC_CC0_CLR;            /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_RTCC_CC1_CLR;            /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_RTCC_CC2_CLR;            /**< CC2 Consumer register                              */
  uint32_t             RESERVED12[1U];                   /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN0_CLR;         /**< CTI consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_CTIIN1_CLR;         /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_CTIIN2_CLR;         /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_CTIIN3_CLR;         /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_M33RXEV_CLR;        /**< M33 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_CC0_CLR;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_CC1_CLR;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_CC2_CLR;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_DTI_CLR;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS1_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS2_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_CC0_CLR;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_CC1_CLR;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_CC2_CLR;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_DTI_CLR;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS1_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS2_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_CC0_CLR;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_CC1_CLR;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_CC2_CLR;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_DTI_CLR;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS1_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS2_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_CC0_CLR;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_CC1_CLR;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_CC2_CLR;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_DTI_CLR;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS1_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS2_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_CC0_CLR;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_CC1_CLR;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_CC2_CLR;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_DTI_CLR;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_DTIFS1_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_DTIFS2_CLR;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_USART0_CLK_CLR;          /**< CLK consumer register                              */
  __IOM uint32_t       CONSUMER_USART0_IR_CLR;           /**< IR Consumer register                               */
  __IOM uint32_t       CONSUMER_USART0_RX_CLR;           /**< RX Consumer register                               */
  __IOM uint32_t       CONSUMER_USART0_TRIGGER_CLR;      /**< TRIGGER Consumer register                          */
  uint32_t             RESERVED13[3U];                   /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_USART1_CLK_CLR;          /**< CLK consumer register                              */
  __IOM uint32_t       CONSUMER_USART1_IR_CLR;           /**< IR Consumer register                               */
  __IOM uint32_t       CONSUMER_USART1_RX_CLR;           /**< RX Consumer register                               */
  __IOM uint32_t       CONSUMER_USART1_TRIGGER_CLR;      /**< TRIGGER Consumer register                          */
  __IOM uint32_t       CONSUMER_WDOG0_SRC0_CLR;          /**< SRC0 consumer register                             */
  __IOM uint32_t       CONSUMER_WDOG0_SRC1_CLR;          /**< SRC1 Consumer register                             */
  uint32_t             RESERVED14[913U];                 /**< Reserved for future use                            */
  __IM uint32_t        IPVERSION_TGL;                    /**< IP version ID                                      */
  uint32_t             RESERVED15[1U];                   /**< Reserved for future use                            */
  __IOM uint32_t       ASYNC_SWPULSE_TGL;                /**< Software Pulse Register                            */
  __IOM uint32_t       ASYNC_SWLEVEL_TGL;                /**< Software Level Register                            */
  __IM uint32_t        ASYNC_PEEK_TGL;                   /**< Async Channel Values                               */
  __IM uint32_t        SYNC_PEEK_TGL;                    /**< Sync Channel Values                                */
  PRS_ASYNC_CH_TypeDef ASYNC_CH_TGL[12U];                /**< Async Channel registers                            */
  PRS_SYNC_CH_TypeDef  SYNC_CH_TGL[4U];                  /**< Sync Channel registers                             */
  __IOM uint32_t       CONSUMER_CMU_CALDN_TGL;           /**< CALDN consumer register                            */
  __IOM uint32_t       CONSUMER_CMU_CALUP_TGL;           /**< CALUP Consumer register                            */
  __IOM uint32_t       CONSUMER_EUSART0_CLK_TGL;         /**< CLK consumer register                              */
  __IOM uint32_t       CONSUMER_EUSART0_RX_TGL;          /**< RX Consumer register                               */
  __IOM uint32_t       CONSUMER_EUSART0_TRIGGER_TGL;     /**< TRIGGER Consumer register                          */
  __IOM uint32_t       CONSUMER_FRC_RXRAW_TGL;           /**< RXRAW consumer register                            */
  __IOM uint32_t       CONSUMER_IADC0_SCANTRIGGER_TGL;   /**< SCAN consumer register                             */
  __IOM uint32_t       CONSUMER_IADC0_SINGLETRIGGER_TGL; /**< SINGLE Consumer register                           */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ0_TGL;    /**< DMAREQ0 consumer register                          */
  __IOM uint32_t       CONSUMER_LDMAXBAR_DMAREQ1_TGL;    /**< DMAREQ1 Consumer register                          */
  __IOM uint32_t       CONSUMER_LETIMER0_CLEAR_TGL;      /**< CLEAR consumer register                            */
  __IOM uint32_t       CONSUMER_LETIMER0_START_TGL;      /**< START Consumer register                            */
  __IOM uint32_t       CONSUMER_LETIMER0_STOP_TGL;       /**< STOP Consumer register                             */
  __IOM uint32_t       CONSUMER_MODEM_DIN_TGL;           /**< DIN consumer register                              */
  __IOM uint32_t       CONSUMER_PRORTC_CC0_TGL;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_PRORTC_CC1_TGL;          /**< CC1 Consumer register                              */
  uint32_t             RESERVED16[11U];                  /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_RAC_CLR_TGL;             /**< CLR consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN0_TGL;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN1_TGL;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN2_TGL;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_CTIIN3_TGL;          /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_FORCETX_TGL;         /**< FORCETX Consumer register                          */
  __IOM uint32_t       CONSUMER_RAC_RXDIS_TGL;           /**< RXDIS Consumer register                            */
  __IOM uint32_t       CONSUMER_RAC_RXEN_TGL;            /**< RXEN Consumer register                             */
  __IOM uint32_t       CONSUMER_RAC_SEQ_TGL;             /**< SEQ Consumer register                              */
  __IOM uint32_t       CONSUMER_RAC_TXEN_TGL;            /**< TXEN Consumer register                             */
  __IOM uint32_t       CONSUMER_RTCC_CC0_TGL;            /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_RTCC_CC1_TGL;            /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_RTCC_CC2_TGL;            /**< CC2 Consumer register                              */
  uint32_t             RESERVED17[1U];                   /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_CORE_CTIIN0_TGL;         /**< CTI consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_CTIIN1_TGL;         /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_CTIIN2_TGL;         /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_CTIIN3_TGL;         /**< CTI Consumer register                              */
  __IOM uint32_t       CONSUMER_CORE_M33RXEV_TGL;        /**< M33 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_CC0_TGL;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_CC1_TGL;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_CC2_TGL;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_DTI_TGL;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS1_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER0_DTIFS2_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_CC0_TGL;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_CC1_TGL;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_CC2_TGL;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_DTI_TGL;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS1_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER1_DTIFS2_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_CC0_TGL;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_CC1_TGL;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_CC2_TGL;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_DTI_TGL;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS1_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER2_DTIFS2_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_CC0_TGL;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_CC1_TGL;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_CC2_TGL;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_DTI_TGL;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS1_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER3_DTIFS2_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_CC0_TGL;          /**< CC0 consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_CC1_TGL;          /**< CC1 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_CC2_TGL;          /**< CC2 Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_DTI_TGL;          /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_DTIFS1_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_TIMER4_DTIFS2_TGL;       /**< DTI Consumer register                              */
  __IOM uint32_t       CONSUMER_USART0_CLK_TGL;          /**< CLK consumer register                              */
  __IOM uint32_t       CONSUMER_USART0_IR_TGL;           /**< IR Consumer register                               */
  __IOM uint32_t       CONSUMER_USART0_RX_TGL;           /**< RX Consumer register                               */
  __IOM uint32_t       CONSUMER_USART0_TRIGGER_TGL;      /**< TRIGGER Consumer register                          */
  uint32_t             RESERVED18[3U];                   /**< Reserved for future use                            */
  __IOM uint32_t       CONSUMER_USART1_CLK_TGL;          /**< CLK consumer register                              */
  __IOM uint32_t       CONSUMER_USART1_IR_TGL;           /**< IR Consumer register                               */
  __IOM uint32_t       CONSUMER_USART1_RX_TGL;           /**< RX Consumer register                               */
  __IOM uint32_t       CONSUMER_USART1_TRIGGER_TGL;      /**< TRIGGER Consumer register                          */
  __IOM uint32_t       CONSUMER_WDOG0_SRC0_TGL;          /**< SRC0 consumer register                             */
  __IOM uint32_t       CONSUMER_WDOG0_SRC1_TGL;          /**< SRC1 Consumer register                             */
} PRS_TypeDef;
/** @} End of group MGM27_PRS */

/**************************************************************************//**
 * @addtogroup MGM27_PRS
 * @{
 * @defgroup MGM27_PRS_BitFields PRS Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for PRS IPVERSION */
#define _PRS_IPVERSION_RESETVALUE                            0x00000005UL                            /**< Default value for PRS_IPVERSION             */
#define _PRS_IPVERSION_MASK                                  0xFFFFFFFFUL                            /**< Mask for PRS_IPVERSION                      */
#define _PRS_IPVERSION_IPVERSION_SHIFT                       0                                       /**< Shift value for PRS_IPVERSION               */
#define _PRS_IPVERSION_IPVERSION_MASK                        0xFFFFFFFFUL                            /**< Bit mask for PRS_IPVERSION                  */
#define _PRS_IPVERSION_IPVERSION_DEFAULT                     0x00000005UL                            /**< Mode DEFAULT for PRS_IPVERSION              */
#define PRS_IPVERSION_IPVERSION_DEFAULT                      (_PRS_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_IPVERSION      */

